<?php

/*

 * 关于考研和考证的座位选择

 */



namespace app\index\controller;

use app\index\service\Select  as SelectModel;

use app\index\controller\Base;

use think\Controller;

use think\Session;

use think\Url;

class Select extends Base{



	//考研或考证选座的渲染

	public function select(){



        $select = new SelectModel();

        if(!empty(Input("param.id"))){

            //id表示考证或考研

            $roomid         = Input("param.id");

            $data           = $select->getRoomInfo($roomid);

            $this->assign('data',$data);

            $this->assign("usage",$roomid);

            return $this->fetch();

        }else{

            return view('Index/select');

        }

        

    }

    //到自习室中选座位

    //实现方法->将room.html座位一个模板，从数据库中取数据然后渲染到模板上

    public  function seat(){ 

        $select  = new SelectModel();

        

        if(!empty(Input("param.id"))){

          //id表示 自习室 房号

          $roomid  = Input("param.id");

          $data    = $select->getSeatInfo($roomid);

          $choosed = array();//已选

          $i       = 0;

          $seatmap24 = array(

                         1=>"1_1",2=>"1_2",3=>"1_4",4=>"1_5",5=>"2_1",6=>"2_2",7=>"2_4",8=>"2_5",9=>"4_1",10=>"4_2",11=>"4_4",12=>"4_5",13=>"5_1",14=>"5_2",15=>"5_4",16=>"5_5",17=>"7_1",18=>"7_2",19=>"7_4",20=>"7_5",21=>"8_1",22=>"8_2",23=>"8_4",24=>"8_5"

                ); 

          $seatmap28r = array(

                        1=>"1_4",2=>"1_5",3=>"1_6",4=>"1_7",5=>"2_4",6=>"2_5",7=>"2_6",8=>"2_7",9=>"4_4",10=>"4_5",11=>"4_6",12=>"4_7",13=>"5_4",14=>"5_5",15=>"5_6",16=>"5_7",17=>"7_1",18=>"7_2",19=>"7_4",20=>"7_5",21=>"7_6",22=>"7_7",23=>"8_1",24=>"8_2",25=>"8_4",26=>"8_5",27=>"8_6",28=>"8_7"

                );  

          $seatmap28l = array(

                        1=>"1_1",2=>"1_2",3=>"1_4",4=>"1_5",5=>"2_1",6=>"2_2",7=>"2_3",8=>"2_4",9=>"4_1",10=>"4_2",11=>"4_3",12=>"4_4",13=>"5_",14=>"5_2",15=>"5_3",16=>"5_4",17=>"7_1",18=>"7_2",19=>"7_3",20=>"7_4",21=>"7_6",22=>"7_7",23=>"8_1",24=>"8_2",25=>"8_3",26=>"8_4",27=>"8_6",28=>"8_7"

                );

          $seatmap32r = array(

                        1=>"1_1",2=>"1_2",3=>"1_3",4=>"1_4",5=>"1_6",6=>"1_7",7=>"2_1",8=>"2_2",9=>"2_3",10=>"2_4",11=>"2_6",12=>"2_7",13=>"4_1",14=>"4_2",15=>"4_3",16=>"4_4",17=>"4_6",18=>"4_7",19=>"5_1",20=>"5_2",21=>"5_3",22=>"5_4",23=>"5_6",24=>"5_7",25=>"7_1",26=>"7_2",27=>"7_3",28=>"7_4",29=>"8_1",30=>"8_2",31=>"8_3",32=>"8_4"

                ); 

          $seatmap32l = array(

                         1=>"1_1",2=>"1_2",3=>"1_4",4=>"1_5",5=>"1_6",6=>"1_7",7=>"2_1",8=>"2_2",9=>"2_4",10=>"2_5",11=>"2_6",12=>"2_7",13=>"4_1",14=>"4_2",15=>"4_4",16=>"4_5",17=>"4_6",18=>"4_7",19=>"5_1",20=>"5_2",21=>"5_4",22=>"5_5",23=>"5_6",24=>"5_7",25=>"7_4",26=>"7_5",27=>"7_6",28=>"7_7",29=>"8_4",30=>"8_5",31=>"8_6",32=>"8_7"

            );

          $seatmap64l = array(

                         1=>"1_1",2=>"1_2",3=>"1_3",4=>"1_4",5=>"2_1",6=>"2_2",7=>"2_3",8=>"2_4",9=>"4_1",10=>"4_2",11=>"4_3",12=>"4_4",13=>"4_6",14=>"4_7",15=>"5_1",16=>"5_2",17=>"5_3",18=>"5_4",19=>"5_6",20=>"5_7",21=>"7_1",22=>"7_2",23=>"7_3",24=>"7_4",25=>"7_6",26=>"7_7",27=>"8_1",28=>"8_2",29=>"8_3",30=>"8_4",31=>"8_6",32=>"8_7",33=>"10_1",34=>"10_2",35=>"10_3",36=>"10_4",37=>"10_6",38=>"10_7",39=>"11_1",40=>"11_2",41=>"11_3",42=>"11_4",43=>"11_6",44=>"11_7",45=>"13_1",46=>"13_2",47=>"13_3",48=>"13_4",49=>"13_6",50=>"13_7",51=>"14_1",52=>"14_2",53=>"14_3",54=>"14_4",55=>"14_6",56=>"14_7",57=>"16_1",58=>"16_2",59=>"16_3",60=>"16_4",61=>"17_1",62=>"17_2",63=>"17_3",64=>"17_4"

            );

          $seatmap64r = array(

                           1=>"1_4",2=>"1_5",3=>"1_6",4=>"1_7",5=>"2_4",6=>"2_5",7=>"2_6",8=>"2_7",9=>"4_1",10=>"4_2",11=>"4_4",12=>"4_5",13=>"4_6",14=>"4_7",15=>"5_1",16=>"5_2",17=>"5_4",18=>"5_5",19=>"5_6",20=>"5_7",21=>"7_1",22=>"7_2",23=>"7_4",24=>"7_5",25=>"7_6",26=>"7_7",27=>"8_1",28=>"8_2",29=>"8_4",30=>"8_5",31=>"8_6",32=>"8_7",33=>"10_1",34=>"10_2",35=>"10_4",36=>"10_5",37=>"10_6",38=>"10_7",39=>"11_1",40=>"11_2",41=>"11_4",42=>"11_5",43=>"11_6",44=>"11_7",45=>"13_1",46=>"13_2",47=>"13_4",48=>"13_5",49=>"13_6",50=>"13_7",51=>"14_1",52=>"14_2",53=>"14_4",54=>"14_5",55=>"14_6",56=>"14_7",57=>"16_4",58=>"16_5",59=>"16_6",60=>"16_7",61=>"17_4",62=>"17_5",63=>"17_6",64=>"17_7"

            );

          $seatmap96 = array(

                         1=>"1_1",2=>"1_2",3=>"1_3",4=>"1_4",5=>"1_6",6=>"1_7",7=>"2_1",8=>"2_2",9=>"2_3",10=>"2_4",11=>"2_6",12=>"2_7",13=>"4_1",14=>"4_2",15=>"4_3",16=>"4_4",17=>"4_6",18=>"4_7",19=>"5_1",20=>"5_2",21=>"5_3",22=>"5_4",23=>"5_6",24=>"5_7",25=>"7_1",26=>"7_2",27=>"7_3",28=>"7_4",29=>"7_6",30=>"7_7",31=>"8_1",32=>"8_2",33=>"8_3",34=>"8_4",35=>"8_6",36=>"8_7",37=>"10_1",38=>"10_2",39=>"10_3",40=>"10_4",41=>"11_1",42=>"11_2",43=>"11_3",44=>"11_4",45=>"13_1",46=>"13_2",47=>"13_3",48=>"13_4",49=>"13_6",50=>"13_7",51=>"14_1",52=>"14_2",53=>"14_3",54=>"14_4",55=>"14_6",56=>"14_7",57=>"16_1",58=>"16_2",59=>"16_3",60=>"16_4",61=>"17_1",62=>"17_2",63=>"17_3",64=>"17_4",65=>"19_1",66=>"19_2",67=>"19_3",68=>"19_4",69=>"19_6",70=>"19_7",71=>"20_1",72=>"20_2",73=>"20_3",74=>"20_4",75=>"20_6",76=>"20_7",77=>"22_1",78=>"22_2",79=>"22_3",80=>"22_4",81=>"22_6",82=>"22_7",83=>"23_1",84=>"23_2",85=>"23_3",86=>"23_4",87=>"23_6",88=>"23_7",89=>"25_1",90=>"25_2",91=>"25_3",92=>"25_4",93=>"25_1",94=>"25_2",95=>"25_3",96=>"25_4"

            );

          //获取房间信息

          $roomdata= $select->getRoomById($roomid);

          //$data 将获取数据 分类，已选和未选

          $num     = $roomdata['room_id']%2;

          if($roomdata['room_number']==24){

            $map = $seatmap24;

          }else if($roomdata['room_number']==28){

            if($num!=0){

              //奇数

                $map = $seatmap28l;

            }else{

              //偶数

                $map = $seatmap28r;

            }

           

          }else if($roomdata['room_number']==32){

            if($num!=0){

               $map = $seatmap32r;

            }else{

               $map = $seatmap32l;

            }

          }else if($roomdata['room_number']==64){

            if($num!=0){

               $map = $seatmap64r;

            }else{

               $map = $seatmap64l;

            }

          }else{

            $map = $seatmap96;

          }

          foreach($data as $k=>$v){

             if($v['seat_state']==1){

                $choosed[$i++]=$map[$v['seat_id']];

             }

          }

          $choosed = implode("','", $choosed);

          $choosed = "'".$choosed."'";

          $this->assign('choosed',$choosed);

          $this->assign('data',$roomdata);

          if($roomdata['room_number']==24){

            return $this->fetch('room24');

          }else if($roomdata['room_number']==28){

            if($num!=0){

              return $this->fetch('room28l');

            }else{

              return $this->fetch('room28r');

            }

          }else if($roomdata['room_number']==32){

            if($num!=0){

              return $this->fetch('room32r');

            }else{

              return $this->fetch('room32l');

            }

          }else if($roomdata['room_number']==64){

            if($num!=0){

              return $this->fetch('room64r');

            }else{

              return $this->fetch('room64l');

            }

          }else{

            return $this->fetch('room96');

          }

        }

        return $this->fetch('Index/select');



    	

    } 

    //座位选择的确定

    public function seatSure(){

      $select          = new SelectModel();

    	if(request()->isAjax()){

            $number = Session::get("number");

            $isSelect      = $select->getIsSelect($number);

            $isTime        = $this->checkTime();

            //此处应该加一个判断，判断大一大二不能选

            $num           = "20".substr($number,0,2);

            $num           = (int)$num;

            $year          = date('Y',time());

            $month         = date('m',time());

             //是否在时间范围内

            if(!$isTime){

              return json(array("code"=>0,"message"=>"不在规定时间范围内"));

            }

            if($year-$num<=2){

                if($month<9){
                  return json(array("code"=>0,"message"=>"抱歉，大一大二不能选座"));
                }
            }

            if($isSelect){

                return json(array("code"=>0,"message"=>"抱歉，您已经选完座位"));

                //$this->error("",'APP_MAIN/Index/user');

            }

            //否则 开始选座

            $roomid        = $_POST['roomid'];

            $seatid        = $_POST['seatid'];

            $id            = $select->saveStudentSeatInfo($number,$roomid,$seatid);

            if($id){

            	return json(array("code"=>1,"message"=>"选座成功，等待审核"));

            }

            return json(array("code"=>0,"message"=>"该座位已被选"));

    	}else{

    		return view("select");

    	}

    }

    //检验抢座时间是否过期

    public function checkTime(){

        $select   = new SelectModel();

        $array    = $select->getTimeArrange();

        $time     = time();//获取当前时间戳

        $stime    = strtotime($array['stimer']);//开始时间

        $etime    = strtotime($array['etimer']);//结束时间

        if($time>$etime||$time<$stime){

           //不在规定时间范围内

           return false;

        }else{

           return true;

        }

    }

	



       

}

?>